mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf36xm/mb9bf36xm.svd
        <!-- REGISTER "REVC1" -->
        <register>
          <name>REVC1</name>
          <description>Output Reverse Register 1 [BHW]</description>
          <addressOffset>0x144</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REV23" -->
            <field>
              <name>REV23</name>
              <description>PPG23 Output Reverse Enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV22" -->
            <field>
              <name>REV22</name>
              <description>PPG22 Output Reverse Enable bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV21" -->
            <field>
              <name>REV21</name>
              <description>PPG21 Output Reverse Enable bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV20" -->
            <field>
              <name>REV20</name>
              <description>PPG20 Output Reverse Enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV19" -->
            <field>
              <name>REV19</name>
              <description>PPG19 Output Reverse Enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV18" -->
            <field>
              <name>REV18</name>
              <description>PPG18 Output Reverse Enable bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV17" -->
            <field>
              <name>REV17</name>
              <description>PPG17 Output Reverse Enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV16" -->
            <field>
              <name>REV16</name>
              <description>PPG16 Output Reverse Enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PPGC0" -->
        <register>
          <name>PPGC0</name>
          <description>PPG Operation Mode Control Register 0 [BHW]</description>
          <addressOffset>0x201</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PIE" -->
            <field>
              <name>PIE</name>
              <description>PPG Interrupt Enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PUF" -->
            <field>
              <name>PUF</name>
              <description>PPG Counter Underflow bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTM" -->
            <field>
              <name>INTM</name>
              <description>Interrupt Mode Select bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCS" -->
            <field>
              <name>PCS</name>
              <description>PPG DOWN Counter Operation Clock Select bits</description>
              <msb>4</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MD" -->
            <field>
              <name>MD</name>
              <description>PPG Operation Mode Set bits</description>
              <msb>2</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TTRG" -->
            <field>
              <name>TTRG</name>
              <description>PPG start trigger select bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PPGC1" -->
        <register>
          <name>PPGC1</name>
          <description>PPG Operation Mode Control Register 1 [BHW]</description>
          <addressOffset>0x200</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PIE" -->
            <field>
              <name>PIE</name>
              <description>PPG Interrupt Enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PUF" -->
            <field>
              <name>PUF</name>
              <description>PPG Counter Underflow bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTM" -->
            <field>
              <name>INTM</name>
              <description>Interrupt Mode Select bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCS" -->
            <field>
              <name>PCS</name>
              <description>PPG DOWN Counter Operation Clock Select bits</description>
              <msb>4</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
